
props_mapping = {
  "Электроустановка": {
    "Подразделение": "Подразделение",
    "Электроустановка": "Электроустановка"
  },
  "СШ": {
    "СШ, №яч.": "СШ, №яч."
  },
  "яч": {
  },
  "КТП(Н)": {
    "Дисп. наименование КТП(Н)": "Дисп. наименование КТП(Н)",
    "S, кВА": "S, кВА",
    "I ном., А": "I ном., А",
    "№ авт. (тип)": "№ авт. (тип)",
    "I ном.авт., А": "I ном.авт., А",
    "Тип блока защит АВ-0, 4кВ": "Тип блока защит АВ-0,4кВ",
    "Прогрузка АВ-0,4кВ": "Прогрузка АВ-0,4кВ",
    "Уставка МТЗ": "Уставка МТЗ",
    "Уставка МТО": "Уставка МТО",
    "Диап. рег. уст. МТЗ": "Диап. рег. уст. МТЗ",
    "Диап. рег. уст. МТО": "Диап. рег. уст. МТО",
    "Загр. КТПН, %": "Загр. КТПН, %",
    "U факт. КТПН, В": "U факт. КТПН, В",
    "Рем. № КТПН": "Рем. № КТПН"
  },
  "Потребитель": {
    "Потребитель": "Потребитель",
    "ЭЦН, ШГН": "ЭЦН, ШГН",
    "Р факт., кВт": "Р факт., кВт",
    "Состояние": "Состояние",
    "I факт., А": "I факт., А",
    "ПБВ Кол-во": "ПБВ Кол-во",
    "ПБВ Полож.": "ПБВ Полож.",
    "Дата замера": "Дата замера",
    "U на СУ, В": "U на СУ, В",
    "Селективность действия защит": "Селективность действия защит",
    "Qжидк., куб.м./с": "Qжидк., куб.м./с",
    "Qн., тонн": "Qн., тонн",
    "Время АПВ, мин.": "Время АПВ, мин."
    }
}
props_mapping["Электроустановка"].update({
    "department_num": "department_num",
    "eu_type": "eu_type",
    "eu_node_name": "eu_node_name",
    "eu_primitiveName": "eu_primitiveName"
})
props_mapping["СШ"].update({
    "section_name": "section_name"
})
props_mapping["яч"].update({
    "section_tap_num": "section_tap_num"
})
props_mapping["КТП(Н)"].update({
    "ktpn_num": "ktpn_num",
    "ktpn_object_type": "ktpn_object_type",
    "ktpn_node_name": "ktpn_node_name",
    "ktpn_primitiveName": "ktpn_primitiveName"

})
props_mapping["Потребитель"].update({
    "pad_num": "pad_num"
})


